In [1]:
import numpy as np

In [2]:
import pandas as pd
import html5lib

In [3]:
url = 'https://en.wikipedia.org/wiki/World_population'

In [6]:
tables = pd.read_html(url, flavor='html5lib')

In [7]:
len(tables)

26

In [14]:
world_topten = tables[0]

In [16]:
world_topten = world_topten['World population (millions, UN estimates)[14]']

In [18]:
world_topten = world_topten.drop(11, axis=0)

In [21]:
world_topten = world_topten.drop('#', axis=1)

In [23]:
world_topten.columns = ['Country', '2000', '2015', '2030 Est.']

In [24]:
world_topten

          Country  2000  2015 2030 Est.
0        China[B]  1270  1376      1416
1           India  1053  1311      1528
2   United States   283   322       356
3       Indonesia   212   258       295
4        Pakistan   136   208       245
5          Brazil   176   206       228
6         Nigeria   123   182       263
7      Bangladesh   131   161       186
8          Russia   146   146       149
9          Mexico   103   127       148
10    World total  6127  7349      8501

In [26]:
tables[6].set_index('Rank')

             Country  Population  Area(km2)  Density(pop/km2) Population trend
Rank
1              India  1379100000    3287240               420          Growing
2           Pakistan   224220000     803940               279          Growing
3         Bangladesh   170970000     143998              1187  Rapidly growing
4              Japan   126010000     377873               333    Declining[98]
5        Philippines   110460000     300000               368          Growing
6            Vietnam    96209000     331689               290          Growing
7     United Kingdom    66436000     243610               273           Steady
8        South Korea    51781000      99538               520           Steady
9             Taiwan    23604000      36193               652           Steady
10         Sri Lanka    21803000      65610               332          Growing

In [ ]:
world_topten.to_html('sample_table.html', index=False)